app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author", "genre", "price", "published_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    book = Book.create(book_params)

UPDATE "books" SET "published_date" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["published_date", "1937-11-23"], ["updated_at", "2020-09-15 19:04:54.298193"], ["id", 1]]
---
  def update
    @book.update(book_params)

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def current_book
    @book = Book.find(params[:id])